h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/tricore_general/ssc/src/Mcal_TcLib.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2013)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
********************************************************************************
**                                                                            **
**   $FILENAME   : Mcal_TcLib.c $                                             **
**                                                                            **
**   $CC VERSION : \main\57 $                                                 **
**                                                                            **
**   $DATE       : 2016-08-04 $                                               **
**                                                                            **
**   AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                            **
**   VENDOR      : Infineon Technologies                                      **
**                                                                            **
**   DESCRIPTION : This file contains Mcal Tricore library routines           **
**                                                                            **
**   SPECIFICATION(S) :    NA                                                 **
**                                                                            **
**   MAY BE CHANGED BY USER [yes/no]: no                                      **
**                                                                            **
*******************************************************************************/
/*******************************************************************************
**  TRACEABILITY : [cover parentID= SAS_NAS_ALL_PR455, SAS_NAS_ALL_PR128,
SAS_NAS_ALL_PR70,SAS_NAS_ALL_PR1652,SAS_NAS_ALL_PR630_PR631,SAS_NAS_ALL_PR470,
DS_NAS_MCALLIB_PR131,DS_NAS_MCALLIB_PR115]
                   [/cover]
*******************************************************************************/
/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
#include "Std_Types.h"
#include "IfxCpu_reg.h"
#include "IfxCpu_bf.h"
#include "IfxSrc_reg.h"
#include "IfxScu_reg.h"
/* Own header file */
#include "Mcal.h"
#include "Mcal_Options.h"


/*******************************************************************************
**                      File Inclusion Check                                  **
*******************************************************************************/
#ifndef MCAL_SW_MAJOR_VERSION
#error "MCAL_SW_MAJOR_VERSION is not defined. "
#endif

#ifndef MCAL_SW_MINOR_VERSION
  #error "MCAL_SW_MINOR_VERSION is not defined. "
#endif

#ifndef MCAL_SW_PATCH_VERSION
#error "MCAL_SW_PATCH_VERSION is not defined. "
#endif

#if ( MCAL_SW_MAJOR_VERSION != 1 )
  #error "MCAL_SW_MAJOR_VERSION does not match. "
#endif

#if ( MCAL_SW_MINOR_VERSION != 0 )
  #error "MCAL_SW_MINOR_VERSION does not match. "
#endif

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
#define MCAL_DBGST_HALT  (0U)
#define MCAL_DBGST_RUN   (1U)
#define MCAL_PMST_NORMAL (1U)
#define MCAL_PMST_IDLE   (3U)


/* Macros for Mcal_GetDsprReMapAddress */
#define MCAL_DSPR_GLOBAL_MASK         (0xF0000000U)
#define MCAL_DSPR_GLOBAL_MASK_N       (~MCAL_DSPR_GLOBAL_MASK)
#define MCAL_VALID_DSPR_MSB           (0xD0000000U)
/*Local mask of 0x0003FFFFU is chosen to work with all ranges 72 - 240kb */
#define MCAL_DSPR_LOCAL_MASK          (0x0003FFFFU)

#define MCAL_CORE0_DSPR_BASE_ADDR     (0x70000000U)
#define MCAL_CORE1_DSPR_BASE_ADDR     (0x60000000U)
#define MCAL_CORE2_DSPR_BASE_ADDR     (0x50000000U)

#define MCAL_SAFETY_ENDINT_TIMEOUT ((uint32)150000U)

#define DBGSR_HALT_CLRMSK            (0x00001FC9U)
#define DBGSR_HALT_SETMSK            (0x02U << 1U)

/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/
#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TCLIB_START_SEC_VAR_INIT_32BIT
#include "MemMap.h"
#else
#define IFX_MCAL_TCLIB_START_SEC_VAR_INIT_32BIT_ASIL_B
#include "Ifx_MemMap.h"
#endif

#ifndef OS_KERNEL_TYPE

/* Variables are not used when OS_KERNEL_TYPE is defined */
/* used for nesting enable/disable management */
#if ( MCAL_NO_OF_CORES == 3U )
static uint32 Mcal_SavedIntState[MCAL_NO_OF_CORES] = {0U,0U,0U};
static uint32 Mcal_IntDisableCounter[MCAL_NO_OF_CORES] = {0U,0U,0U};
static uint32 Mcal_SavedIntStateRedn[MCAL_NO_OF_CORES] = {0xFFFFFFFFU,
                                                          0xFFFFFFFFU,
                                                          0xFFFFFFFFU};
static uint32 Mcal_IntDisableCounterRedn[MCAL_NO_OF_CORES] = {0xFFFFFFFFU,
                                                              0xFFFFFFFFU,
                                                              0xFFFFFFFFU};

#elif ( MCAL_NO_OF_CORES == 2U )
static uint32 Mcal_SavedIntState[MCAL_NO_OF_CORES] = {0U,0U};
static uint32 Mcal_IntDisableCounter[MCAL_NO_OF_CORES] = {0U,0U};
static uint32 Mcal_SavedIntStateRedn[MCAL_NO_OF_CORES] = {0xFFFFFFFFU,
                                                          0xFFFFFFFFU};
static uint32 Mcal_IntDisableCounterRedn[MCAL_NO_OF_CORES] = {0xFFFFFFFFU,
                                                              0xFFFFFFFFU};

#else /*( MCAL_NO_OF_CORES == 1U )*/
static uint32 Mcal_SavedIntState[MCAL_NO_OF_CORES] = {0U};
static uint32 Mcal_IntDisableCounter[MCAL_NO_OF_CORES] = {0U};
static uint32 Mcal_SavedIntStateRedn[MCAL_NO_OF_CORES] = {0xFFFFFFFFU};
static uint32 Mcal_IntDisableCounterRedn[MCAL_NO_OF_CORES] = {0xFFFFFFFFU};
#endif /*End for MCAL_NO_OF_CORES */


#endif /*End for OS_KERNEL_TYPE */

#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TCLIB_STOP_SEC_VAR_INIT_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
#else
#define IFX_MCAL_TCLIB_STOP_SEC_VAR_INIT_32BIT_ASIL_B
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "Ifx_MemMap.h"
#endif
/*
 * To be used for all global or static variables
 * that are never  initialized.
 */
#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TCLIB_START_SEC_CONST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
#else
#define IFX_MCAL_TCLIB_START_SEC_CONST_32BIT_ASIL_B
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "Ifx_MemMap.h"
#endif

