h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/tricore_general/ssc/src/Mcal_TcLib.c
#if ( MCAL_NO_OF_CORES > 1U )
/* used only if no of cores is greater than 1 */
/*IFX_MISRA_RULE_08_07_STATUS=The variable Mcal_CpuAddressMap is made
 global to reduce the code complexity*/
static Ifx_CPU* const Mcal_CpuAddressMap[MCAL_NO_OF_CORES] =
{
  &MODULE_CPU0

  #if ( MCAL_NO_OF_CORES > 1U )
  ,&MODULE_CPU1

  #if ( MCAL_NO_OF_CORES == 3U )
  ,&MODULE_CPU2
  #endif /* ( MCAL_NO_OF_CORES == 3U )  */

  #endif /* ( MCAL_NO_OF_CORES > 1U ) */
};
#endif /*End for MCAL_NO_OF_CORES*/

#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TCLIB_STOP_SEC_CONST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
#else
#define IFX_MCAL_TCLIB_STOP_SEC_CONST_32BIT_ASIL_B
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "Ifx_MemMap.h"
#endif


#if (IFX_MCAL_USED == STD_ON)
/*Memory Map of the Code*/
#define MCAL_TCLIB_START_SEC_CODE
/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
#else
#define IFX_MCAL_TCLIB_START_SEC_CODE_ASIL_B
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "Ifx_MemMap.h"
#endif

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/
#if ( MCAL_NO_OF_CORES > 1U )
static Ifx_CPU* Mcal_GetCpuAddress(uint8 CpuId);
#endif /*End for MCAL_NO_OF_CORES */


/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR122_13,
SAS_NAS_MCALLIB_PR472][/cover]                                                **
** Syntax : uint32 Mcal_GetCoreId(void)                                       **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in) :  None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  Core ID                                                 **
**                                                                            **
** Description : This function returns the core ID of the core on which       **
              it is executing.                                                **
*******************************************************************************/
uint8 Mcal_GetCoreId(void)
{
  uint8 RetVal;

  RetVal = (uint8)MFCR(CPU_CORE_ID);
  return RetVal;
}

/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR122_14,
SAS_NAS_MCALLIB_PR472][/cover]                                                **
** Syntax : uint32 Mcal_GetDsprReMapAddress(uint32 Address)                   **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in) :  None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  Remapped DSPR address                                   **
**                                                                            **
** Description : This function maps the DSPR address to the global address    **
              which can be used by other cores or Dma                         **
*******************************************************************************/
uint32 Mcal_GetDsprReMapAddress(uint32 Address)
{
  uint32 RetAddress;
  uint8  CoreId;


  /*Initialise Return value with the input global address*/
  RetAddress = Address;

  if ((Address & MCAL_DSPR_GLOBAL_MASK) == MCAL_VALID_DSPR_MSB)
  {
    CoreId = Mcal_GetCoreId();
    #if defined MCALLIB_DEBUG1
    #if (MCALLIB_DEBUG1 == STD_ON)
    CoreId = 1U;
    #endif
    #elif defined MCALLIB_DEBUG2
    #if (MCALLIB_DEBUG2 == STD_ON)
    CoreId = 2U;
    #endif
    #endif

    switch(CoreId)
    {
      case 0:
       if( (Address & MCAL_DSPR_GLOBAL_MASK_N) < MCAL_DSPR0_SIZE)
       {
         RetAddress = ((Address & MCAL_DSPR_LOCAL_MASK) |
                        MCAL_CORE0_DSPR_BASE_ADDR);
       }
       break;

      case 1:
      #if ( MCAL_NO_OF_CORES > 1U )
        if( (Address & MCAL_DSPR_GLOBAL_MASK_N) < MCAL_DSPR1_SIZE)
        {
          RetAddress = ((Address & MCAL_DSPR_LOCAL_MASK) |
                         MCAL_CORE1_DSPR_BASE_ADDR);
          /*TC24x and lower - core 1 Not Available*/
        }
      #endif
        break;

      default:
      #if ( MCAL_NO_OF_CORES == 3U )
        if( (Address & MCAL_DSPR_GLOBAL_MASK_N) < MCAL_DSPR2_SIZE)
        {
         RetAddress = ((Address & MCAL_DSPR_LOCAL_MASK) |
                        MCAL_CORE2_DSPR_BASE_ADDR);
         /*TC26x and lower - core 2 Not Available*/
        }
      #endif
        break;
    }
  }
  return RetAddress;
}

