h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/tricore_general/ssc/src/Mcal_TcLib.c
#if ( MCAL_NO_OF_CORES > 1U )
/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR75_5]      [/cover]   **
**                                                                            **
** Syntax : Ifx_CPU* Mcal_GetCpuAddress(uint8 CpuId)                          **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in) :  None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  CPU base address                                        **
**                                                                            **
** Description : This function get the CPU base address of the provided CPU ID**
*******************************************************************************/
static Ifx_CPU* Mcal_GetCpuAddress(uint8 CpuId)
{
  Ifx_CPU* module;

  /* Get the base address of the CPU from the structure */
  module = Mcal_CpuAddressMap[CpuId];

  return(module);
}
#endif /*End for MCAL_NO_OF_CORES */
#if ( MCAL_NO_OF_CORES > 1U )
/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR75_6,
SAS_NAS_MCALLIB_PR472]                                        [/cover]        **
**                                                                            **
** Syntax : void Mcal_SetCpuPC (uint8 CpuNo, uint32 ProgramCounter)           **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in) :  CpuNo - CPU index                                       **
**                    ProgramCounter - Address to be updated in PC register   **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  None                                                    **
**                                                                            **
** Description : This function updates the PC register of the corresponding   **
**               CPU with the provided address                                **
*******************************************************************************/
void Mcal_SetCpuPC (uint8 CpuNo, uint32 ProgramCounter)
{
  Ifx_CPU* CpuBase;

  if( CpuNo < MCAL_NO_OF_CORES )
  {
    /* Get the base address of the CPU */
    CpuBase = Mcal_GetCpuAddress(CpuNo);
    /* Set the PC */
    CpuBase->PC.U = ProgramCounter;
  }
}
#endif /*End for MCAL_NO_OF_CORES */
#if ( MCAL_NO_OF_CORES > 1U )
/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR75_29,
SAS_NAS_MCALLIB_PR75_7,SAS_NAS_MCALLIB_PR472]                         [/cover]**
**                                                                            **
** Syntax : void Mcal_StartCore (uint8 CpuNo, uint32 Pcval)                   **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Reentrant                                                     **
**                                                                            **
** Parameters (in) :  CpuNo - CPU index                                       **
**                    Pcval - Address to be updated in PC register            **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  None                                                    **
**                                                                            **
** Description : This function updates the PC register of the corresponding   **
**               CPU with the provided address and puts the CPU to run mode   **
*******************************************************************************/
void Mcal_StartCore (uint8 CpuNo, uint32 Pcval)
{
  Ifx_CPU* CpuBase;
  volatile Ifx_CPU_DBGSR DbgsrValue;

  if( CpuNo < MCAL_NO_OF_CORES )
  {
    CpuBase = Mcal_GetCpuAddress(CpuNo);

    /* Set the PC for the Core*/
    Mcal_SetCpuPC (CpuNo, Pcval);

    /* Set the CPU to run mode */
    DbgsrValue.U = CpuBase->DBGSR.U;
  
    /* Writing a value 0x2 t0 DBGSR.HALT bits Reg to set the CPU to run mode */
    /*Reserved bit access is taken care */
  CpuBase->DBGSR.U = ((DbgsrValue.U & DBGSR_HALT_CLRMSK) |                     \
                                               (uint32)(DBGSR_HALT_SETMSK));
  
