h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/tricore_general/ssc/src/Mcal_TcLib.c
  RetVal = E_NOT_OK;

  if( SpinLckPtr != NULL_PTR )
  {
    do
    {

      SpinLockVal = 1UL;
      SpinLockVal = (uint32)
          Mcal_CmpAndSwap((unsigned_int*)(void*)SpinLckPtr,SpinLockVal,0U);

      /* Check if the SpinLock WAS set before the attempt to acquire spinlock */
      if(SpinLockVal == 0U)
      {
        RetVal = E_OK;
      }
      else
      {
        Timeout-- ;

      }
    } while((RetVal == E_NOT_OK) && (Timeout > 0U));
  }

  return(RetVal);
}

/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR75_11,
SAS_NAS_MCALLIB_PR472]                                           [/cover]     **
**                                                                            **
** Syntax           : void Mcal_ReleaseSpinLock                               **
**                    (                                                       **
**                      uint32* SpinLckPtr                                    **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters(in)   : SpinLckPtr: Spinlock to be released                     **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      :                                                         **
**                                                                            **
*******************************************************************************/
void Mcal_ReleaseSpinLock(uint32* SpinLckPtr)
{
  if( SpinLckPtr != NULL_PTR )
  {
    /* Reset the SpinLock */
    *SpinLckPtr = 0U;
  }
}

/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR75_12,
SAS_NAS_MCALLIB_PR472]  [/cover]                                              **
**                                                                            **
** Syntax           : void Mcal_SuspendAllInterrupts(void)                    **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : Mcal_SuspendAllInterrupts, disables all interrupts      **
**                    Nesting disable/enable supported                        **
**                    This API shall not be called prior to C-init            **
*******************************************************************************/
void Mcal_SuspendAllInterrupts(void)
{
  #ifndef OS_KERNEL_TYPE
  uint32 CoreID;
  uint32 ICRState;
  uint32 ICRStateRedn;
  #endif

  #ifdef OS_KERNEL_TYPE
    SuspendAllInterrupts();
  #else
  CoreID = (uint32)MFCR(CPU_CORE_ID);

  if(Mcal_IntDisableCounter[CoreID] == 0U)
  {
    ICRState = (uint32)MFCR(CPU_ICR);

    ICRStateRedn = (uint32)(~(uint32)ICRState);

    /* disable interrupts */
    Mcal_DisableAllInterrupts();

    /* At this point Interrupts are already disabled */
    Mcal_SavedIntState[CoreID] = ICRState;
    Mcal_SavedIntStateRedn[CoreID] = ICRStateRedn;
  }

  Mcal_IntDisableCounter[CoreID]++;
  Mcal_IntDisableCounterRedn[CoreID]--;

  /* The check is done at the end as interrupts are disabled
     either by this call or previously*/
  /* Inconsistency is reported.It is NOT expected to return from the callback*/
  /* Incase, there is a return, proceed with normal functioning */
  if(Mcal_IntDisableCounter[CoreID] != (~Mcal_IntDisableCounterRedn[CoreID]))
  {
     Mcal_SafeErrorHandler(MCAL_DIV_INCONSISTENCY);
  }
  #endif
}

/*******************************************************************************
** Traceability     : [cover parentID=SAS_NAS_MCALLIB_PR75_13,
SAS_NAS_MCALLIB_PR472]  [/cover]                                              **
**                                                                            **
**                                                                            **
** Syntax           : void Mcal_ResumeAllInterrupts( void )                   **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : Mcal_ResumeAllInterrupts, re-enables interrupts         **
**                    Nesting disable/enable supported                        **
**                    This API shall not be called prior to C-init            **
*******************************************************************************/
void Mcal_ResumeAllInterrupts(void)
{
  #ifndef OS_KERNEL_TYPE
  uint32 CoreID;
  uint32 IntDisableCntr;
  uint32 IntDisableCntrRedn;
  uint32 SavedIntState;
  uint32 SavedIntStateRedn;
  #endif

