h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/tricore_general/ssc/src/Mcal_TcLib.c
  #ifdef OS_KERNEL_TYPE
    ResumeAllInterrupts();
  #else
  CoreID = (uint32)MFCR(CPU_CORE_ID);

  /* Take local copies of the required global variables */
  IntDisableCntr = Mcal_IntDisableCounter[CoreID];
  IntDisableCntrRedn = Mcal_IntDisableCounterRedn[CoreID];
  SavedIntState = Mcal_SavedIntState[CoreID];
  SavedIntStateRedn = Mcal_SavedIntStateRedn[CoreID];

  /* Check for consistency */
  /* Inconsistency is reported.It is NOT expected to return from the callback */
  /* Incase, there is a return, proceed with normal functioning */
  if((IntDisableCntr != (~IntDisableCntrRedn)) ||
     (SavedIntState != (~SavedIntStateRedn)))
  {
     Mcal_SafeErrorHandler(MCAL_DIV_INCONSISTENCY);
  }

  if(IntDisableCntr > 0U)
  {
    IntDisableCntr-- ;
    IntDisableCntrRedn++;
  }

  Mcal_IntDisableCounter[CoreID] = IntDisableCntr;
  Mcal_IntDisableCounterRedn[CoreID] = IntDisableCntrRedn;


  if(IntDisableCntr == 0U)
  {
    if ((SavedIntState &
        ((uint32)IFX_CPU_ICR_IE_LEN << IFX_CPU_ICR_IE_OFF)) != 0U)
    {
      /* interrupts were enabled, enable again */
      Mcal_EnableAllInterrupts();
    }
  }
  #endif
}

/* (IFX_MCAL_RUN_MODE_DEFINE != (0U)) */
#if (IFX_MCAL_USED == STD_ON)
/*Memory Map of the Code*/
#define MCAL_TCLIB_STOP_SEC_CODE
/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
#else
#define IFX_MCAL_TCLIB_STOP_SEC_CODE_ASIL_B
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "Ifx_MemMap.h"
#endif
